# prob: จำนวนครั้งที่น้อยที่สุด ที่กดเเล้วได้ i
# basis: d[1] = 0 เราไม่ต้องกดสักครั้งเลย เพื่อให้ได้เลข 1
#        d[i] = จำนวนครั้งที่กดเเล้วได้ i
        
# +1
# *2
# *3
# ถ้า i = 5 เราจะเริ่มที่ 1 เเล้วก็คูณ 2 = 2 * 2 อีก = 4 + 1 = 5 ดังนั้นเราจะได้ทำ operation 3 รอบ
# สิ่งที่เราต้องเริ่มอยู่เเล้วก้คือ เริ่มที่  เเล้วก็บวกสุดท้ายที่ 1
# induction: min()


N = int(input())

dp = [N + 1] * (N + 1)
dp[1] = 0

for i in range(2, N + 1):
    dp[i] = dp[i - 1] + 1  

    if i % 2 == 0:
        dp[i] = min(dp[i], dp[i // 2] + 1)

    if i % 3 == 0:
        dp[i] = min(dp[i], dp[i // 3] + 1)

print(dp[N])