income = float(input()) # รับรายได้เข้ามา

# บรรทัดล่างที่เป็น if elif ก้คือ แบบว่ารายได้ 150000 ก็จะเข้า if อันแรก ถ้ามากกว่านั้น 250000 ก็จะเข้า elif ตัวที่ 2 ไปคำนวนตามที่ครูให้มาอ่ะ 
if 0 <= income <= 150000:
    tax = 0
elif 150001 <= income <= 300000:
    tax = (income - 150000) * 0.05
elif 300001 <= income <= 500000:
    tax = (150000 * 0.05) + (income - 300000) * 0.1
elif 500001 <= income <= 750000:
    tax = (150000 * 0.05) + (200000 * 0.1) + (income - 500000) * 0.15
elif 750001 <= income <= 1000000:
    tax = (150000 * 0.05) + (200000 * 0.1) + (250000 * 0.15) + (income - 750000) * 0.20

print(tax)
